/* Details size format string */
"%@ bytes" = "%@ bytes";

/* Details window title format string */
"%@ Details" = "%@ Details";

/* name of source item for virtual destination */
"Act as a destination for other programs" = "Act as a destination for other programs";

/* Restart y/n? */
"Are you sure you want to restart now?" = "Are you sure you want to restart now?";

/* error reason for unknown file contents */
"Can't read the contents of the file." = "Can't read the contents of the file.";

/* Cancel button title */
"Cancel" = "Cancel";

/* change channel undo action */
"Change Channel" = "Change Channel";

/* change filter undo action */
"Change Filter" = "Change Filter";

/* change history limit undo action */
"Change Remembered Events" = "Change Remembered Events";

/* change source undo action */
"Change Selected Sources" = "Change Selected Sources";

/* Continue button after MIDI spy client creation fails
   Continue button if spy driver install fails */
"Continue" = "Continue";

/* title of error alert */
"Error" = "Error";

/* Explanation when expert mode is off */
"EXPERT_OFF" = "• Data formatted according to settings above\n• Note On with velocity 0 shows as Note Off\n• Zero timestamp shows time received";

/* Explanation when expert mode is on */
"EXPERT_ON" = "• Data formatted as raw hexadecimal\n• Note On with velocity 0 shows as Note On\n• Zero timestamp shows 0";

/* second line of warning when MIDI spy is unavailable */
"If you continue, MIDI Monitor will not be able to see the output of other MIDI applications, but all other features will still work.\n\nTo fix the problem:\n1. Remove any old 32-bit-only drivers from /Library/Audio/MIDI Drivers.\n2. Restart your computer." = "If you continue, MIDI Monitor will not be able to see the output of other MIDI applications, but all other features will still work.\n\nTo fix the problem:\n1. Remove any old 32-bit-only drivers from /Library/Audio/MIDI Drivers.\n2. Restart your computer.";

/* title of MIDI error panel */
"MIDI Error" = "MIDI Error";

/* message of alert when can't send feedback email */
"MIDI Monitor could not ask your email application to create a new message.\nPlease send email to:\n%@" = "MIDI Monitor could not ask your email application to create a new message.\nPlease send email to:\n%@";

/* error message if spy driver install fails */
"MIDI Monitor could not install its driver." = "MIDI Monitor could not install its driver.";

/* error message if MIDI spy client creation fails */
"MIDI Monitor could not make a connection to its MIDI driver." = "MIDI Monitor could not make a connection to its MIDI driver.";

/* subject of feedback email */
"MIDI Monitor Feedback" = "MIDI Monitor Feedback";

/* more suggestion if spy driver install fails */
"MIDI Monitor will not be able to see the output of other MIDI applications, but all other features will still work." = "MIDI Monitor will not be able to see the output of other MIDI applications, but all other features will still work.";

/* name of group for ordinary sources */
"MIDI sources" = "MIDI sources";

/* title of quit button */
"Quit" = "Quit";

/* error message if MIDIRestart() fails */
"Rescanning the MIDI system resulted in an unexpected error (%d)." = "Rescanning the MIDI system resulted in an unexpected error (%d).";

/* Restart button after MIDI spy client creation fails
   Restart button title */
"Restart" = "Restart";

/* Show in Finder button if spy driver install fails */
"Show in Finder" = "Show in Finder";

/* Show MIDI Drivers button after MIDI spy client creation fails */
"Show MIDI Drivers" = "Show MIDI Drivers";

/* name of group for spying on destinations */
"Spy on output to destinations" = "Spy on output to destinations";

/* error message if help file can't be found */
"The help file could not be found." = "The help file could not be found.";

/* error message if opening the help file fails */
"The help file could not be opened." = "The help file could not be opened.";

/* error message if MIDI initialization fails */
"The MIDI system could not be started." = "The MIDI system could not be started.";

/* informative text if MIDI initialization fails */
"This probably affects all apps that use MIDI, not just MIDI Monitor.\n\nMost likely, the cause is a bad MIDI driver. Remove any MIDI drivers that you don't recognize, then try again." = "This probably affects all apps that use MIDI, not just MIDI Monitor.\n\nMost likely, the cause is a bad MIDI driver. Remove any MIDI drivers that you don't recognize, then try again.";

/* suggestion if spy driver install fails due to our own error */
"This shouldn't happen. Try downloading MIDI Monitor again." = "This shouldn't happen. Try downloading MIDI Monitor again.";

/* name of missing endpoint if not specified in document */
"Unknown" = "Unknown";

/* error reason for unknown file type read or write */
"Unknown file type." = "Unknown file type.";

